Autodesk.Revit.DB.LineProperties
A structure that has access to the pen properties of lines/curves
that are currently being drawn/exported via an export context
during a custom export process.
Remarks:
For more about using properties of this class refer to the interface
Autodesk.Revit.DB.IModelExportContext and its methods
which handle geometric objects such as Autodesk.Revit.DB.IExportContextBase.OnCurve(Autodesk.Revit.DB.CurveNode),
Autodesk.Revit.DB.IExportContextBase.OnLineSegment(Autodesk.Revit.DB.LineSegment), etc.
LineProperties are available as a read-only property on the respective output nodes,
i.e. Autodesk.Revit.DB.CurveNode, Autodesk.Revit.DB.LineSegment, etc.
Since:
2016